{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "abdominal hernia",
    "1": "acne",
    "2": "actinic keratosis",
    "3": "acute bronchiolitis",
    "4": "acute bronchitis",
    "5": "acute bronchospasm",
    "6": "acute kidney injury",
    "7": "acute otitis media",
    "8": "acute pancreatitis",
    "9": "acute respiratory distress syndrome (ards)",
    "10": "acute sinusitis",
    "11": "acute stress reaction",
    "12": "adjustment reaction",
    "13": "alcohol abuse",
    "14": "alcohol withdrawal",
    "15": "allergy",
    "16": "angina",
    "17": "ankylosing spondylitis",
    "18": "anxiety",
    "19": "aortic valve disease",
    "20": "appendicitis",
    "21": "arthritis of the hip",
    "22": "asthma",
    "23": "atrophic skin condition",
    "24": "attention deficit hyperactivity disorder (adhd)",
    "25": "autism",
    "26": "balanitis",
    "27": "bell palsy",
    "28": "benign paroxysmal positional vertical (bppv)",
    "29": "benign prostatic hyperplasia (bph)",
    "30": "benign vaginal discharge (leukorrhea)",
    "31": "bipolar disorder",
    "32": "bladder disorder",
    "33": "blepharitis",
    "34": "brachial neuritis",
    "35": "breast infection (mastitis)",
    "36": "bursitis",
    "37": "callus",
    "38": "carpal tunnel syndrome",
    "39": "cataract",
    "40": "chalazion",
    "41": "cholecystitis",
    "42": "choledocholithiasis",
    "43": "chronic back pain",
    "44": "chronic constipation",
    "45": "chronic glaucoma",
    "46": "chronic obstructive pulmonary disease (copd)",
    "47": "chronic otitis media",
    "48": "chronic pain disorder",
    "49": "chronic sinusitis",
    "50": "common cold",
    "51": "complex regional pain syndrome",
    "52": "concussion",
    "53": "conduct disorder",
    "54": "conductive hearing loss",
    "55": "conjunctivitis",
    "56": "conjunctivitis due to allergy",
    "57": "conjunctivitis due to virus",
    "58": "contact dermatitis",
    "59": "cornea infection",
    "60": "corneal abrasion",
    "61": "corneal disorder",
    "62": "croup",
    "63": "cystitis",
    "64": "degenerative disc disease",
    "65": "delirium",
    "66": "dental caries",
    "67": "depression",
    "68": "dermatitis due to sun exposure",
    "69": "developmental disability",
    "70": "deviated nasal septum",
    "71": "diabetic ketoacidosis",
    "72": "diabetic peripheral neuropathy",
    "73": "diabetic retinopathy",
    "74": "diaper rash",
    "75": "diverticulitis",
    "76": "diverticulosis",
    "77": "drug abuse",
    "78": "drug abuse (opioids)",
    "79": "drug reaction",
    "80": "dry eye of unknown cause",
    "81": "dysthymic disorder",
    "82": "ear drum damage",
    "83": "ear wax impaction",
    "84": "eating disorder",
    "85": "eczema",
    "86": "envenomation from spider or animal bite",
    "87": "epididymitis",
    "88": "erectile dysfunction",
    "89": "esophagitis",
    "90": "eustachian tube dysfunction (ear disorder)",
    "91": "eye alignment disorder",
    "92": "fibromyalgia",
    "93": "flu",
    "94": "food allergy",
    "95": "fracture of the arm",
    "96": "fracture of the facial bones",
    "97": "fracture of the leg",
    "98": "fracture of the rib",
    "99": "fungal infection of the hair",
    "100": "fungal infection of the skin",
    "101": "gallstone",
    "102": "ganglion cyst",
    "103": "gastritis",
    "104": "gastroduodenal ulcer",
    "105": "gastroesophageal reflux disease (gerd)",
    "106": "gastrointestinal hemorrhage",
    "107": "glaucoma",
    "108": "gout",
    "109": "gum disease",
    "110": "heart attack",
    "111": "heart block",
    "112": "heart failure",
    "113": "hemangioma",
    "114": "hemiplegia",
    "115": "hemorrhoids",
    "116": "herniated disk",
    "117": "herpangina",
    "118": "hiatal hernia",
    "119": "hyperemesis gravidarum",
    "120": "hyperkalemia",
    "121": "hypertensive heart disease",
    "122": "hypoglycemia",
    "123": "hypokalemia",
    "124": "hyponatremia",
    "125": "hypovolemia",
    "126": "idiopathic absence of menstruation",
    "127": "idiopathic excessive menstruation",
    "128": "idiopathic irregular menstrual cycle",
    "129": "idiopathic painful menstruation",
    "130": "ileus",
    "131": "impetigo",
    "132": "indigestion",
    "133": "infectious gastroenteritis",
    "134": "ingrown toe nail",
    "135": "inguinal hernia",
    "136": "injury to the arm",
    "137": "injury to the face",
    "138": "injury to the leg",
    "139": "injury to the shoulder",
    "140": "injury to the trunk",
    "141": "insect bite",
    "142": "interstitial lung disease",
    "143": "intestinal obstruction",
    "144": "intracerebral hemorrhage",
    "145": "iridocyclitis",
    "146": "iron deficiency anemia",
    "147": "irritable bowel syndrome",
    "148": "ischemic heart disease",
    "149": "itching of unknown cause",
    "150": "joint effusion",
    "151": "kidney stone",
    "152": "labyrinthitis",
    "153": "laryngitis",
    "154": "lipoma",
    "155": "liver disease",
    "156": "lymphadenitis",
    "157": "lymphedema",
    "158": "macular degeneration",
    "159": "marijuana abuse",
    "160": "mitral valve disease",
    "161": "molluscum contagiosum",
    "162": "mononeuritis",
    "163": "multiple sclerosis",
    "164": "muscle spasm",
    "165": "myopia",
    "166": "neuralgia",
    "167": "neurosis",
    "168": "noninfectious gastroenteritis",
    "169": "nose disorder",
    "170": "obsessive compulsive disorder (ocd)",
    "171": "obstructive sleep apnea (osa)",
    "172": "onychomycosis",
    "173": "oppositional disorder",
    "174": "oral mucosal lesion",
    "175": "oral thrush (yeast infection)",
    "176": "osteoarthritis",
    "177": "otitis externa (swimmer's ear)",
    "178": "otitis media",
    "179": "ovarian cyst",
    "180": "pain after an operation",
    "181": "panic disorder",
    "182": "parkinson disease",
    "183": "paronychia",
    "184": "paroxysmal ventricular tachycardia",
    "185": "pelvic inflammatory disease",
    "186": "pelvic organ prolapse",
    "187": "peripheral nerve disorder",
    "188": "personality disorder",
    "189": "pleural effusion",
    "190": "pneumonia",
    "191": "post-traumatic stress disorder (ptsd)",
    "192": "postpartum depression",
    "193": "problem during pregnancy",
    "194": "prostatitis",
    "195": "psoriasis",
    "196": "psychotic disorder",
    "197": "pulmonary congestion",
    "198": "pulmonary embolism",
    "199": "pulmonary hypertension",
    "200": "pyelonephritis",
    "201": "pyogenic skin infection",
    "202": "rectal disorder",
    "203": "rheumatoid arthritis",
    "204": "rosacea",
    "205": "schizophrenia",
    "206": "sciatica",
    "207": "seasonal allergies (hay fever)",
    "208": "sebaceous cyst",
    "209": "seborrheic dermatitis",
    "210": "seborrheic keratosis",
    "211": "sensorineural hearing loss",
    "212": "sepsis",
    "213": "sialoadenitis",
    "214": "sickle cell crisis",
    "215": "sinus bradycardia",
    "216": "skin cancer",
    "217": "skin disorder",
    "218": "skin pigmentation disorder",
    "219": "skin polyp",
    "220": "smoking or tobacco addiction",
    "221": "social phobia",
    "222": "spinal stenosis",
    "223": "spondylitis",
    "224": "spondylolisthesis",
    "225": "spondylosis",
    "226": "spontaneous abortion",
    "227": "sprain or strain",
    "228": "strep throat",
    "229": "stroke",
    "230": "stye",
    "231": "teething syndrome",
    "232": "temporary or benign blood in urine",
    "233": "tendinitis",
    "234": "threatened pregnancy",
    "235": "thrombophlebitis",
    "236": "tonsillitis",
    "237": "tooth abscess",
    "238": "tooth disorder",
    "239": "transient ischemic attack",
    "240": "urethritis",
    "241": "urge incontinence",
    "242": "urinary tract infection",
    "243": "urinary tract obstruction",
    "244": "uterine fibroids",
    "245": "vaginal cyst",
    "246": "vaginal yeast infection",
    "247": "vaginitis",
    "248": "varicocele of the testicles",
    "249": "viral exanthem",
    "250": "viral warts",
    "251": "vulvodynia",
    "252": "white blood cell disease",
    "253": "yeast infection"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "abdominal hernia": 0,
    "acne": 1,
    "actinic keratosis": 2,
    "acute bronchiolitis": 3,
    "acute bronchitis": 4,
    "acute bronchospasm": 5,
    "acute kidney injury": 6,
    "acute otitis media": 7,
    "acute pancreatitis": 8,
    "acute respiratory distress syndrome (ards)": 9,
    "acute sinusitis": 10,
    "acute stress reaction": 11,
    "adjustment reaction": 12,
    "alcohol abuse": 13,
    "alcohol withdrawal": 14,
    "allergy": 15,
    "angina": 16,
    "ankylosing spondylitis": 17,
    "anxiety": 18,
    "aortic valve disease": 19,
    "appendicitis": 20,
    "arthritis of the hip": 21,
    "asthma": 22,
    "atrophic skin condition": 23,
    "attention deficit hyperactivity disorder (adhd)": 24,
    "autism": 25,
    "balanitis": 26,
    "bell palsy": 27,
    "benign paroxysmal positional vertical (bppv)": 28,
    "benign prostatic hyperplasia (bph)": 29,
    "benign vaginal discharge (leukorrhea)": 30,
    "bipolar disorder": 31,
    "bladder disorder": 32,
    "blepharitis": 33,
    "brachial neuritis": 34,
    "breast infection (mastitis)": 35,
    "bursitis": 36,
    "callus": 37,
    "carpal tunnel syndrome": 38,
    "cataract": 39,
    "chalazion": 40,
    "cholecystitis": 41,
    "choledocholithiasis": 42,
    "chronic back pain": 43,
    "chronic constipation": 44,
    "chronic glaucoma": 45,
    "chronic obstructive pulmonary disease (copd)": 46,
    "chronic otitis media": 47,
    "chronic pain disorder": 48,
    "chronic sinusitis": 49,
    "common cold": 50,
    "complex regional pain syndrome": 51,
    "concussion": 52,
    "conduct disorder": 53,
    "conductive hearing loss": 54,
    "conjunctivitis": 55,
    "conjunctivitis due to allergy": 56,
    "conjunctivitis due to virus": 57,
    "contact dermatitis": 58,
    "cornea infection": 59,
    "corneal abrasion": 60,
    "corneal disorder": 61,
    "croup": 62,
    "cystitis": 63,
    "degenerative disc disease": 64,
    "delirium": 65,
    "dental caries": 66,
    "depression": 67,
    "dermatitis due to sun exposure": 68,
    "developmental disability": 69,
    "deviated nasal septum": 70,
    "diabetic ketoacidosis": 71,
    "diabetic peripheral neuropathy": 72,
    "diabetic retinopathy": 73,
    "diaper rash": 74,
    "diverticulitis": 75,
    "diverticulosis": 76,
    "drug abuse": 77,
    "drug abuse (opioids)": 78,
    "drug reaction": 79,
    "dry eye of unknown cause": 80,
    "dysthymic disorder": 81,
    "ear drum damage": 82,
    "ear wax impaction": 83,
    "eating disorder": 84,
    "eczema": 85,
    "envenomation from spider or animal bite": 86,
    "epididymitis": 87,
    "erectile dysfunction": 88,
    "esophagitis": 89,
    "eustachian tube dysfunction (ear disorder)": 90,
    "eye alignment disorder": 91,
    "fibromyalgia": 92,
    "flu": 93,
    "food allergy": 94,
    "fracture of the arm": 95,
    "fracture of the facial bones": 96,
    "fracture of the leg": 97,
    "fracture of the rib": 98,
    "fungal infection of the hair": 99,
    "fungal infection of the skin": 100,
    "gallstone": 101,
    "ganglion cyst": 102,
    "gastritis": 103,
    "gastroduodenal ulcer": 104,
    "gastroesophageal reflux disease (gerd)": 105,
    "gastrointestinal hemorrhage": 106,
    "glaucoma": 107,
    "gout": 108,
    "gum disease": 109,
    "heart attack": 110,
    "heart block": 111,
    "heart failure": 112,
    "hemangioma": 113,
    "hemiplegia": 114,
    "hemorrhoids": 115,
    "herniated disk": 116,
    "herpangina": 117,
    "hiatal hernia": 118,
    "hyperemesis gravidarum": 119,
    "hyperkalemia": 120,
    "hypertensive heart disease": 121,
    "hypoglycemia": 122,
    "hypokalemia": 123,
    "hyponatremia": 124,
    "hypovolemia": 125,
    "idiopathic absence of menstruation": 126,
    "idiopathic excessive menstruation": 127,
    "idiopathic irregular menstrual cycle": 128,
    "idiopathic painful menstruation": 129,
    "ileus": 130,
    "impetigo": 131,
    "indigestion": 132,
    "infectious gastroenteritis": 133,
    "ingrown toe nail": 134,
    "inguinal hernia": 135,
    "injury to the arm": 136,
    "injury to the face": 137,
    "injury to the leg": 138,
    "injury to the shoulder": 139,
    "injury to the trunk": 140,
    "insect bite": 141,
    "interstitial lung disease": 142,
    "intestinal obstruction": 143,
    "intracerebral hemorrhage": 144,
    "iridocyclitis": 145,
    "iron deficiency anemia": 146,
    "irritable bowel syndrome": 147,
    "ischemic heart disease": 148,
    "itching of unknown cause": 149,
    "joint effusion": 150,
    "kidney stone": 151,
    "labyrinthitis": 152,
    "laryngitis": 153,
    "lipoma": 154,
    "liver disease": 155,
    "lymphadenitis": 156,
    "lymphedema": 157,
    "macular degeneration": 158,
    "marijuana abuse": 159,
    "mitral valve disease": 160,
    "molluscum contagiosum": 161,
    "mononeuritis": 162,
    "multiple sclerosis": 163,
    "muscle spasm": 164,
    "myopia": 165,
    "neuralgia": 166,
    "neurosis": 167,
    "noninfectious gastroenteritis": 168,
    "nose disorder": 169,
    "obsessive compulsive disorder (ocd)": 170,
    "obstructive sleep apnea (osa)": 171,
    "onychomycosis": 172,
    "oppositional disorder": 173,
    "oral mucosal lesion": 174,
    "oral thrush (yeast infection)": 175,
    "osteoarthritis": 176,
    "otitis externa (swimmer's ear)": 177,
    "otitis media": 178,
    "ovarian cyst": 179,
    "pain after an operation": 180,
    "panic disorder": 181,
    "parkinson disease": 182,
    "paronychia": 183,
    "paroxysmal ventricular tachycardia": 184,
    "pelvic inflammatory disease": 185,
    "pelvic organ prolapse": 186,
    "peripheral nerve disorder": 187,
    "personality disorder": 188,
    "pleural effusion": 189,
    "pneumonia": 190,
    "post-traumatic stress disorder (ptsd)": 191,
    "postpartum depression": 192,
    "problem during pregnancy": 193,
    "prostatitis": 194,
    "psoriasis": 195,
    "psychotic disorder": 196,
    "pulmonary congestion": 197,
    "pulmonary embolism": 198,
    "pulmonary hypertension": 199,
    "pyelonephritis": 200,
    "pyogenic skin infection": 201,
    "rectal disorder": 202,
    "rheumatoid arthritis": 203,
    "rosacea": 204,
    "schizophrenia": 205,
    "sciatica": 206,
    "seasonal allergies (hay fever)": 207,
    "sebaceous cyst": 208,
    "seborrheic dermatitis": 209,
    "seborrheic keratosis": 210,
    "sensorineural hearing loss": 211,
    "sepsis": 212,
    "sialoadenitis": 213,
    "sickle cell crisis": 214,
    "sinus bradycardia": 215,
    "skin cancer": 216,
    "skin disorder": 217,
    "skin pigmentation disorder": 218,
    "skin polyp": 219,
    "smoking or tobacco addiction": 220,
    "social phobia": 221,
    "spinal stenosis": 222,
    "spondylitis": 223,
    "spondylolisthesis": 224,
    "spondylosis": 225,
    "spontaneous abortion": 226,
    "sprain or strain": 227,
    "strep throat": 228,
    "stroke": 229,
    "stye": 230,
    "teething syndrome": 231,
    "temporary or benign blood in urine": 232,
    "tendinitis": 233,
    "threatened pregnancy": 234,
    "thrombophlebitis": 235,
    "tonsillitis": 236,
    "tooth abscess": 237,
    "tooth disorder": 238,
    "transient ischemic attack": 239,
    "urethritis": 240,
    "urge incontinence": 241,
    "urinary tract infection": 242,
    "urinary tract obstruction": 243,
    "uterine fibroids": 244,
    "vaginal cyst": 245,
    "vaginal yeast infection": 246,
    "vaginitis": 247,
    "varicocele of the testicles": 248,
    "viral exanthem": 249,
    "viral warts": 250,
    "vulvodynia": 251,
    "white blood cell disease": 252,
    "yeast infection": 253
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.52.4",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 28996
}
